module Encode(
  encode
) where
import qualified Data.Set           as Sets
import           Data.Array         

{--
   В именах файлов электронных книг, скачанных с сайта techibrary.ru, 
   русские буквы закодированы парой 'цифра'+'строчная латинская буква'.
   Таблица соответствия таких пар русским буквам приведена ниже.

   ---------------------------------
   | Пара символов | Русская буква |
   ---------------------------------
   |     1a        |      а        |
   ---------------------------------
   |     1b        |      б        |
   ---------------------------------
   |     1c        |      в        |
   ---------------------------------
   |     1d        |      г        |
   ---------------------------------
   |     1e        |      д        |
   ---------------------------------
   |     1f        |      е        |
   ---------------------------------
   |     1g        |      ё        |
   ---------------------------------
   |     1h        |      ж        |
   ---------------------------------
   |     1i        |      з        |
   ---------------------------------
   |     1j        |      и        |
   ---------------------------------
   |     1k        |      й        |
   ---------------------------------
   |     1l        |      к        |
   ---------------------------------
   |     1m        |      л        |
   ---------------------------------
   |     1n        |      м        |
   ---------------------------------
   |     1o        |      н        |
   ---------------------------------
   |     1p        |      о        |
   ---------------------------------
   |     1q        |      п        |
   ---------------------------------
   |     1r        |      р        |
   ---------------------------------
   |     1s        |      с        |
   ---------------------------------
   |     1t        |      т        |
   ---------------------------------
   |     1u        |      у        |
   ---------------------------------
   |     1v        |      ф        |
   ---------------------------------
   |     1w        |      х        |
   ---------------------------------
   |     1x        |      ц        |
   ---------------------------------
   |     1y        |      ч        |
   ---------------------------------
   |     1z        |      ш        |
   ---------------------------------
   |     2a        |      щ        |
   ---------------------------------
   |     2b        |      ъ        |
   ---------------------------------
   |     2c        |      ы        |
   ---------------------------------
   |     2d        |      ь        |
   ---------------------------------
   |     2e        |      э        |
   ---------------------------------
   |     2f        |      ю        |
   ---------------------------------
   |     2g        |      я        |
   ---------------------------------
   |     2h        |      А        |
   ---------------------------------
   |     2i        |      Б        |
   ---------------------------------
   |     2j        |      В        |
   ---------------------------------
   |     2k        |      Г        |
   ---------------------------------
   |     2l        |      Д        |
   ---------------------------------
   |     2m        |      Е        |
   ---------------------------------
   |     2n        |      Ё        |
   ---------------------------------
   |     2o        |      Ж        |
   ---------------------------------
   |     2p        |      З        |
   ---------------------------------
   |     2q        |      И        |
   ---------------------------------
   |     2r        |      Й        |
   ---------------------------------
   |     2s        |      К        |
   ---------------------------------
   |     2t        |      Л        |
   ---------------------------------
   |     2u        |      М        |
   ---------------------------------
   |     2v        |      Н        |
   ---------------------------------
   |     2w        |      О        |
   ---------------------------------
   |     2x        |      П        |
   ---------------------------------
   |     2y        |      Р        |
   ---------------------------------
   |     2z        |      С        |
   ---------------------------------
   |     3a        |      Т        |
   ---------------------------------
   |     3b        |      У        |
   ---------------------------------
   |     3c        |      Ф        |
   ---------------------------------
   |     3d        |      Х        |
   ---------------------------------
   |     3e        |      Ц        |
   ---------------------------------
   |     3f        |      Ч        |
   ---------------------------------
   |     3g        |      Ш        |
   ---------------------------------
   |     3h        |      Щ        |
   ---------------------------------
   |     3i        |      Ъ        |
   ---------------------------------
   |     3j        |      Ы        |
   ---------------------------------
   |     3k        |      Ь        |
   ---------------------------------
   |     3l        |      Э        |
   ---------------------------------
   |     3m        |      Ю        |
   ---------------------------------
   |     3n        |      Я        |
   ---------------------------------
   
   
   Для перекодирования имён файлов на этом сайте можно скачать утилиту
   rename.exe. Однако эта утилита работает только под Windows. А что 
   делать, если файл скачан при работе в Linux? Для решения этой 
   проблемы и предназначена программа, содержащая данный модуль.
   Единственная же экспортируемая данным модулем функция предназначена
   как раз для раскодирования исходного имени файла.
 --}

digit1Letters :: Array Char Char
digit1Letters = listArray ('a', 'z')
                ['а','б','в','г','д','е','ё','ж','з','и','й','к','л',
                 'м','н','о','п','р','с','т','у','ф','х','ц','ч','ш']

digit2Letters :: Array Char Char
digit2Letters = listArray ('a', 'z') 
                ['щ','ъ','ы','ь','э','ю','я','А','Б','В','Г','Д','Е',
                 'Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С']

digit3Letters :: Array Char Char
digit3Letters = listArray ('a', 'n')
                ['Т','У','Ф','Х','Ц','Ч','Ш',
                 'Щ','Ъ','Ы','Ь','Э','Ю','Я']

symbolsAfter1Or2 :: Sets.Set Char
symbolsAfter1Or2 = Sets.fromList ['a'..'z']

symbolsAfter3 :: Sets.Set Char
symbolsAfter3 = Sets.fromList ['a'..'n']

underlineToSpace :: Char -> Char
underlineToSpace c = if c == '_' then ' ' else c

encode :: String -> String
encode name = map underlineToSpace . reverse $ encode' name []

encode' :: String -> String -> String
encode' []       acc = acc
encode' (d:c:xs) acc = 
  case d of
    '1' -> if c `Sets.member` symbolsAfter1Or2 then
             encode' xs     $ (digit1Letters ! c):acc
           else
             encode' (c:xs) $ d:acc
    '2' -> if c `Sets.member` symbolsAfter1Or2 then
             encode' xs     $ (digit2Letters ! c):acc
           else
             encode' (c:xs) $ d:acc
    '3' -> if c `Sets.member` symbolsAfter3 then
             encode' xs     $ (digit3Letters ! c):acc
           else
             encode' (c:xs) $ d:acc
    _   -> encode'   (c:xs) $ d:acc
encode' (z:_) acc   = z:acc
